DiffusiveMixing/H-mixer/45deg/p1.0/flowField/system/blockMeshDict
FoamFile
{
	format      ascii;
	class       dictionary;
	object      blockMeshDict;
}

convertToMeters 1;

vertices (
	(-0.00003535533905932738 0.00003535533905932738 0)
	(0.00003535533905932738 -0.00003535533905932738 0)
	(0.00202071067811865476 0.00195000000000000013 0)
	(0.00192928932188134519 0.00200000000000000004 0)
	(0.00003535533905932738 0.00403535533905932751 0)
	(-0.00003535533905932738 0.00396464466094067266 0)
	(0.00202071067811865476 0.00205000000000000017 0)
	(0.00000000000000000000 0.00000000000000000000 0)
	(0.00397928932188134493 0.00195000000000000013 0)
	(0.00000000000000000000 0.00000000000000000000 0)
	(0.00407071067811865493 0.00200000000000000004 0)
	(0.00596464466094067270 -0.00003535533905932738 0)
	(0.00603535533905932755 0.00003535533905932738 0)
	(0.00397928932188134493 0.00205000000000000017 0)
	(0.00603535533905932755 0.00396464466094067266 0)
	(0.00596464466094067270 0.00403535533905932751 0)
	(-0.00003535533905932738 0.00003535533905932738 0.0001)
	(0.00003535533905932738 -0.00003535533905932738 0.0001)
	(0.00202071067811865476 0.00195000000000000013 0.0001)
	(0.00192928932188134519 0.00200000000000000004 0.0001)
	(0.00003535533905932738 0.00403535533905932751 0.0001)
	(-0.00003535533905932738 0.00396464466094067266 0.0001)
	(0.00202071067811865476 0.00205000000000000017 0.0001)
	(0.00000000000000000000 0.00000000000000000000 0.0001)
	(0.00397928932188134493 0.00195000000000000013 0.0001)
	(0.00000000000000000000 0.00000000000000000000 0.0001)
	(0.00407071067811865493 0.00200000000000000004 0.0001)
	(0.00596464466094067270 -0.00003535533905932738 0.0001)
	(0.00603535533905932755 0.00003535533905932738 0.0001)
	(0.00397928932188134493 0.00205000000000000017 0.0001)
	(0.00603535533905932755 0.00396464466094067266 0.0001)
	(0.00596464466094067270 0.00403535533905932751 0.0001)
	(0.00202071067811865476 0.00200000000000000004 0)
	(0.00397928932188134493 0.00200000000000000004 0)
	(0.00200000000000000004 0.00192928932188134519 0)
	(0.00200000000000000004 0.00207071067811865489 0)
	(0.00400000000000000008 0.00192928932188134519 0)
	(0.00400000000000000008 0.00207071067811865489 0)
	(0.00202071067811865476 0.00200000000000000004 0.0001)
	(0.00397928932188134493 0.00200000000000000004 0.0001)
	(0.00200000000000000004 0.00192928932188134519 0.0001)
	(0.00200000000000000004 0.00207071067811865489 0.0001)
	(0.00400000000000000008 0.00192928932188134519 0.0001)
	(0.00400000000000000008 0.00207071067811865489 0.0001)
);


blocks (
	hex (0 1 34 3 16 17 40 19) (80 1132 1) simpleGrading (1 1 1)
	hex (4 5 3 35 20 21 19 41) (80 1132 1) simpleGrading (1 1 1)
	hex (6 32 33 13 22 38 39 29) (80 800 1) simpleGrading (1 1 1)
	hex (32 2 8 33 38 18 24 39) (80 800 1) simpleGrading (1 1 1)
	hex (10 36 11 12 26 42 27 28) (80 1132 1) simpleGrading (1 1 1)
	hex (37 10 14 15 43 26 30 31) (80 1132 1) simpleGrading (1 1 1)
	hex (3 32 6 35 19 38 22 41) (40 80 1) simpleGrading (1 1 1)
	hex (3 34 2 32 19 40 18 38) (80 40 1) simpleGrading (1 1 1)
	hex (33 8 36 10 39 24 42 26) (80 40 1) simpleGrading (1 1 1)
	hex (33 10 37 13 39 26 43 29) (40 80 1) simpleGrading (1 1 1)
);

edges (
);

boundary (
	walls {
		type wall;
		faces (
			(1 34 17 40)
			(3 0 19 16)
			(5 3 21 19)
			(35 4 41 20)
			(2 8 18 24)
			(13 6 29 22)
			(36 11 42 27)
			(12 10 28 26)
			(10 14 26 30)
			(15 37 31 43)
			(34 2 40 18)
			(35 6 41 22)
			(8 36 24 42)
			(13 37 29 43)
		);
	}
	inlet_0 {
		type patch;
		faces (
			(0 1 16 17)
		);
	}
	inlet_1 {
		type patch;
		faces (
			(4 5 20 21)
		);
	}
	outlet_0 {
		type patch;
		faces (
			(11 12 27 28)
		);
	}
	outlet_1 {
		type patch;
		faces (
			(14 15 30 31)
		);
	}
);
